channel_step/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0.5 0)
    (0 1 0)
    (0.5 0 0)
    (0.5 0.5 0)
    (0.5 1 0)
    (5 0 0)
    (5 0.5 0)
    (5 1 0)
    
    (0 0.5 0.1)
    (0 1 0.1)
    (0.5 0 0.1)
    (0.5 0.5 0.1)
    (0.5 1 0.1)
    (5 0 0.1)
    (5 0.5 0.1)
    (5 1 0.1)
);

blocks
(
    hex (0 3 4 1 8 11 12 9) (5 5 1) simpleGrading (1 1 1)
    hex (3 6 7 4 11 14 15 12) (45 5 1) simpleGrading (1 1 1)
    hex (2 5 6 3 10 13 14 11) (45 5 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 8 9)
        );
    }
    outlet
    {
    	type patch;
    	faces
    	(
            (5 6 13 14)
            (6 7 14 15)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 3 8 11)
            (3 2 11 10)
            (2 5 10 13)
            (7 4 15 12)
            (4 1 12 9)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 3 4)
            (8 9 11 12)
            (3 4 6 7)
            (11 12 14 15)
            (2 3 5 6)
            (10 11 13 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
